---
kind: type
id: T:Autodesk.Revit.DB.FilterStringRuleEvaluator
source: html/ba8dad25-3f85-1fbb-a164-323c3750018c.htm
---
# Autodesk.Revit.DB.FilterStringRuleEvaluator

Base for all classes that compare string values from Revit to a user-supplied filter value

## Syntax (C#)
```csharp
public class FilterStringRuleEvaluator : IDisposable
```